<!-- dflook/terraform-github-actions {"workspace":"default","backend":"021f90ee6da3b1aa152f206b42f93677a70c52334d9ea6435b478d1761d0d756","backend_type":"s3","label":"production","plan_job_ref":"Job plan #247 at https://github.com/GSA/datagov-ssb/actions/runs/3008266565","plan_hash":"e4e3e5e866a96de9174e30c690b0c91b163aaa9f85499393f989d2d45c31d649","plan_text_format":"text"} -->
Terraform plan for __production__
<details>
<summary>Plan: 2 to add, 1 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_iam_user_policy_attachment.eks_broker_policies["arn:aws:iam::821341638715:policy/eks_brokerpak_policy"] will be created
  + resource "aws_iam_user_policy_attachment" "eks_broker_policies" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::821341638715:policy/eks_brokerpak_policy"
      + user       = "ssb-eks-broker"
    }

  # module.broker_solrcloud.cloudfoundry_app.ssb will be updated in-place
  ~ resource "cloudfoundry_app" "ssb" {
        id                         = "5424e1bd-bf95-48d2-9f07-06382ef20ce4"
      ~ id_bg                      = "************************************" -> (known after apply)
        name                       = "ssb-solrcloud"
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.eks_brokerpak_policy.aws_iam_policy.policy will be created
  + resource "aws_iam_policy" "policy" {
      + arn         = (known after apply)
      + description = "Policy granting additional permissions needed by the EKS brokerpak"
      + id          = (known after apply)
      + name        = "eks_brokerpak_policy"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:DeleteVpcEndpoints",
                          + "eks:CreateAddon",
                          + "eks:DeleteAddon",
                          + "eks:ListAddons",
                          + "eks:UpdateAddon",
                          + "eks:DescribeAddon",
                          + "eks:DescribeAddonVersions",
                          + "eks:CreateNodegroup",
                          + "eks:DescribeNodegroup",
                          + "eks:ListNodegroups",
                          + "eks:UpdateNodegroupConfig",
                          + "eks:UpdateNodegroupVersion",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [plan #247](https://github.com/GSA/datagov-ssb/actions/runs/3008266565)